GopalSaraf/Practicals/PSDL/include/proc/pic16f1768.inc
// Register: OPA1CON
#define OPA1CON OPA1CON
OPA1CON                                  equ 0511h
// bitfield definitions
OPA1CON_ORM_POSN                         equ 0000h
OPA1CON_ORM_POSITION                     equ 0000h
OPA1CON_ORM_SIZE                         equ 0002h
OPA1CON_ORM_LENGTH                       equ 0002h
OPA1CON_ORM_MASK                         equ 0003h
OPA1CON_ORPOL_POSN                       equ 0002h
OPA1CON_ORPOL_POSITION                   equ 0002h
OPA1CON_ORPOL_SIZE                       equ 0001h
OPA1CON_ORPOL_LENGTH                     equ 0001h
OPA1CON_ORPOL_MASK                       equ 0004h
OPA1CON_UG_POSN                          equ 0004h
OPA1CON_UG_POSITION                      equ 0004h
OPA1CON_UG_SIZE                          equ 0001h
OPA1CON_UG_LENGTH                        equ 0001h
OPA1CON_UG_MASK                          equ 0010h
OPA1CON_EN_POSN                          equ 0007h
OPA1CON_EN_POSITION                      equ 0007h
OPA1CON_EN_SIZE                          equ 0001h
OPA1CON_EN_LENGTH                        equ 0001h
OPA1CON_EN_MASK                          equ 0080h
OPA1CON_ORM0_POSN                        equ 0000h
OPA1CON_ORM0_POSITION                    equ 0000h
OPA1CON_ORM0_SIZE                        equ 0001h
OPA1CON_ORM0_LENGTH                      equ 0001h
OPA1CON_ORM0_MASK                        equ 0001h
OPA1CON_ORM1_POSN                        equ 0001h
OPA1CON_ORM1_POSITION                    equ 0001h
OPA1CON_ORM1_SIZE                        equ 0001h
OPA1CON_ORM1_LENGTH                      equ 0001h
OPA1CON_ORM1_MASK                        equ 0002h
OPA1CON_OPA1ORM_POSN                     equ 0000h
OPA1CON_OPA1ORM_POSITION                 equ 0000h
OPA1CON_OPA1ORM_SIZE                     equ 0002h
OPA1CON_OPA1ORM_LENGTH                   equ 0002h
OPA1CON_OPA1ORM_MASK                     equ 0003h
OPA1CON_OPA1ORPOL_POSN                   equ 0002h
OPA1CON_OPA1ORPOL_POSITION               equ 0002h
OPA1CON_OPA1ORPOL_SIZE                   equ 0001h
OPA1CON_OPA1ORPOL_LENGTH                 equ 0001h
OPA1CON_OPA1ORPOL_MASK                   equ 0004h
OPA1CON_OPA1UG_POSN                      equ 0004h
OPA1CON_OPA1UG_POSITION                  equ 0004h
OPA1CON_OPA1UG_SIZE                      equ 0001h
OPA1CON_OPA1UG_LENGTH                    equ 0001h
OPA1CON_OPA1UG_MASK                      equ 0010h
OPA1CON_OPA1EN_POSN                      equ 0007h
OPA1CON_OPA1EN_POSITION                  equ 0007h
OPA1CON_OPA1EN_SIZE                      equ 0001h
OPA1CON_OPA1EN_LENGTH                    equ 0001h
OPA1CON_OPA1EN_MASK                      equ 0080h
OPA1CON_OPA1ORM0_POSN                    equ 0000h
OPA1CON_OPA1ORM0_POSITION                equ 0000h
OPA1CON_OPA1ORM0_SIZE                    equ 0001h
OPA1CON_OPA1ORM0_LENGTH                  equ 0001h
OPA1CON_OPA1ORM0_MASK                    equ 0001h
OPA1CON_OPA1ORM1_POSN                    equ 0001h
OPA1CON_OPA1ORM1_POSITION                equ 0001h
OPA1CON_OPA1ORM1_SIZE                    equ 0001h
OPA1CON_OPA1ORM1_LENGTH                  equ 0001h
OPA1CON_OPA1ORM1_MASK                    equ 0002h

// Register: OPA1ORS
#define OPA1ORS OPA1ORS
OPA1ORS                                  equ 0512h
// bitfield definitions
OPA1ORS_ORS_POSN                         equ 0000h
OPA1ORS_ORS_POSITION                     equ 0000h
OPA1ORS_ORS_SIZE                         equ 0008h
OPA1ORS_ORS_LENGTH                       equ 0008h
OPA1ORS_ORS_MASK                         equ 00FFh

// Register: OPA2NCHS
#define OPA2NCHS OPA2NCHS
OPA2NCHS                                 equ 0513h
// bitfield definitions
OPA2NCHS_NCH_POSN                        equ 0000h
OPA2NCHS_NCH_POSITION                    equ 0000h
OPA2NCHS_NCH_SIZE                        equ 0008h
OPA2NCHS_NCH_LENGTH                      equ 0008h
OPA2NCHS_NCH_MASK                        equ 00FFh
OPA2NCHS_OPA2NCH_POSN                    equ 0000h
OPA2NCHS_OPA2NCH_POSITION                equ 0000h
OPA2NCHS_OPA2NCH_SIZE                    equ 0008h
OPA2NCHS_OPA2NCH_LENGTH                  equ 0008h
OPA2NCHS_OPA2NCH_MASK                    equ 00FFh

// Register: OPA2PCHS
#define OPA2PCHS OPA2PCHS
OPA2PCHS                                 equ 0514h
// bitfield definitions
OPA2PCHS_PCH_POSN                        equ 0000h
OPA2PCHS_PCH_POSITION                    equ 0000h
OPA2PCHS_PCH_SIZE                        equ 0008h
OPA2PCHS_PCH_LENGTH                      equ 0008h
OPA2PCHS_PCH_MASK                        equ 00FFh
OPA2PCHS_OPA2PCH_POSN                    equ 0000h
OPA2PCHS_OPA2PCH_POSITION                equ 0000h
OPA2PCHS_OPA2PCH_SIZE                    equ 0008h
OPA2PCHS_OPA2PCH_LENGTH                  equ 0008h
OPA2PCHS_OPA2PCH_MASK                    equ 00FFh

// Register: OPA2CON
#define OPA2CON OPA2CON
OPA2CON                                  equ 0515h
// bitfield definitions
OPA2CON_ORM_POSN                         equ 0000h
OPA2CON_ORM_POSITION                     equ 0000h
OPA2CON_ORM_SIZE                         equ 0002h
OPA2CON_ORM_LENGTH                       equ 0002h
OPA2CON_ORM_MASK                         equ 0003h
OPA2CON_ORPOL_POSN                       equ 0002h
OPA2CON_ORPOL_POSITION                   equ 0002h
OPA2CON_ORPOL_SIZE                       equ 0001h
OPA2CON_ORPOL_LENGTH                     equ 0001h
OPA2CON_ORPOL_MASK                       equ 0004h
OPA2CON_UG_POSN                          equ 0004h
OPA2CON_UG_POSITION                      equ 0004h
OPA2CON_UG_SIZE                          equ 0001h
OPA2CON_UG_LENGTH                        equ 0001h
OPA2CON_UG_MASK                          equ 0010h
OPA2CON_EN_POSN                          equ 0007h
OPA2CON_EN_POSITION                      equ 0007h
OPA2CON_EN_SIZE                          equ 0001h
OPA2CON_EN_LENGTH                        equ 0001h
OPA2CON_EN_MASK                          equ 0080h
OPA2CON_ORM0_POSN                        equ 0000h
OPA2CON_ORM0_POSITION                    equ 0000h
OPA2CON_ORM0_SIZE                        equ 0001h
OPA2CON_ORM0_LENGTH                      equ 0001h
OPA2CON_ORM0_MASK                        equ 0001h
OPA2CON_ORM1_POSN                        equ 0001h
OPA2CON_ORM1_POSITION                    equ 0001h
OPA2CON_ORM1_SIZE                        equ 0001h
OPA2CON_ORM1_LENGTH                      equ 0001h
OPA2CON_ORM1_MASK                        equ 0002h
OPA2CON_OPA2ORM_POSN                     equ 0000h
OPA2CON_OPA2ORM_POSITION                 equ 0000h
OPA2CON_OPA2ORM_SIZE                     equ 0002h
OPA2CON_OPA2ORM_LENGTH                   equ 0002h
OPA2CON_OPA2ORM_MASK                     equ 0003h
OPA2CON_OPA2ORPOL_POSN                   equ 0002h
OPA2CON_OPA2ORPOL_POSITION               equ 0002h
OPA2CON_OPA2ORPOL_SIZE                   equ 0001h
OPA2CON_OPA2ORPOL_LENGTH                 equ 0001h
OPA2CON_OPA2ORPOL_MASK                   equ 0004h
OPA2CON_OPA2UG_POSN                      equ 0004h
OPA2CON_OPA2UG_POSITION                  equ 0004h
OPA2CON_OPA2UG_SIZE                      equ 0001h
OPA2CON_OPA2UG_LENGTH                    equ 0001h
OPA2CON_OPA2UG_MASK                      equ 0010h
OPA2CON_OPA2EN_POSN                      equ 0007h
OPA2CON_OPA2EN_POSITION                  equ 0007h
OPA2CON_OPA2EN_SIZE                      equ 0001h
OPA2CON_OPA2EN_LENGTH                    equ 0001h
OPA2CON_OPA2EN_MASK                      equ 0080h
OPA2CON_OPA2ORM0_POSN                    equ 0000h
OPA2CON_OPA2ORM0_POSITION                equ 0000h
OPA2CON_OPA2ORM0_SIZE                    equ 0001h
OPA2CON_OPA2ORM0_LENGTH                  equ 0001h
OPA2CON_OPA2ORM0_MASK                    equ 0001h
OPA2CON_OPA2ORM1_POSN                    equ 0001h
OPA2CON_OPA2ORM1_POSITION                equ 0001h
OPA2CON_OPA2ORM1_SIZE                    equ 0001h
OPA2CON_OPA2ORM1_LENGTH                  equ 0001h
OPA2CON_OPA2ORM1_MASK                    equ 0002h

// Register: OPA2ORS
#define OPA2ORS OPA2ORS
OPA2ORS                                  equ 0516h
// bitfield definitions
OPA2ORS_ORS_POSN                         equ 0000h
OPA2ORS_ORS_POSITION                     equ 0000h
OPA2ORS_ORS_SIZE                         equ 0008h
OPA2ORS_ORS_LENGTH                       equ 0008h
OPA2ORS_ORS_MASK                         equ 00FFh

// Register: DACLD
#define DACLD DACLD
DACLD                                    equ 0590h
// bitfield definitions
DACLD_DAC1LD_POSN                        equ 0000h
DACLD_DAC1LD_POSITION                    equ 0000h
DACLD_DAC1LD_SIZE                        equ 0001h
DACLD_DAC1LD_LENGTH                      equ 0001h
DACLD_DAC1LD_MASK                        equ 0001h
DACLD_DAC2LD_POSN                        equ 0001h
DACLD_DAC2LD_POSITION                    equ 0001h
DACLD_DAC2LD_SIZE                        equ 0001h
DACLD_DAC2LD_LENGTH                      equ 0001h
DACLD_DAC2LD_MASK                        equ 0002h

// Register: DAC1CON0
#define DAC1CON0 DAC1CON0
DAC1CON0                                 equ 0591h
// bitfield definitions
DAC1CON0_NSS_POSN                        equ 0000h
DAC1CON0_NSS_POSITION                    equ 0000h
DAC1CON0_NSS_SIZE                        equ 0002h
DAC1CON0_NSS_LENGTH                      equ 0002h
DAC1CON0_NSS_MASK                        equ 0003h
DAC1CON0_PSS_POSN                        equ 0002h
DAC1CON0_PSS_POSITION                    equ 0002h
DAC1CON0_PSS_SIZE                        equ 0002h
DAC1CON0_PSS_LENGTH                      equ 0002h
DAC1CON0_PSS_MASK                        equ 000Ch
DAC1CON0_OE1_POSN                        equ 0005h
DAC1CON0_OE1_POSITION                    equ 0005h
DAC1CON0_OE1_SIZE                        equ 0001h
DAC1CON0_OE1_LENGTH                      equ 0001h
DAC1CON0_OE1_MASK                        equ 0020h
DAC1CON0_FM_POSN                         equ 0006h
DAC1CON0_FM_POSITION                     equ 0006h
DAC1CON0_FM_SIZE                         equ 0001h
DAC1CON0_FM_LENGTH                       equ 0001h
DAC1CON0_FM_MASK                         equ 0040h
DAC1CON0_EN_POSN                         equ 0007h
DAC1CON0_EN_POSITION                     equ 0007h
DAC1CON0_EN_SIZE                         equ 0001h
DAC1CON0_EN_LENGTH                       equ 0001h
DAC1CON0_EN_MASK                         equ 0080h
DAC1CON0_NSS0_POSN                       equ 0000h
DAC1CON0_NSS0_POSITION                   equ 0000h
DAC1CON0_NSS0_SIZE                       equ 0001h
DAC1CON0_NSS0_LENGTH                     equ 0001h
DAC1CON0_NSS0_MASK                       equ 0001h
DAC1CON0_PSS0_POSN                       equ 0002h
DAC1CON0_PSS0_POSITION                   equ 0002h
DAC1CON0_PSS0_SIZE                       equ 0001h
DAC1CON0_PSS0_LENGTH                     equ 0001h
DAC1CON0_PSS0_MASK                       equ 0004h
DAC1CON0_PSS1_POSN                       equ 0003h
DAC1CON0_PSS1_POSITION                   equ 0003h
DAC1CON0_PSS1_SIZE                       equ 0001h
DAC1CON0_PSS1_LENGTH                     equ 0001h
DAC1CON0_PSS1_MASK                       equ 0008h
DAC1CON0_OE_POSN                         equ 0005h
DAC1CON0_OE_POSITION                     equ 0005h
DAC1CON0_OE_SIZE                         equ 0001h
DAC1CON0_OE_LENGTH                       equ 0001h
DAC1CON0_OE_MASK                         equ 0020h
DAC1CON0_DACNSS_POSN                     equ 0000h
DAC1CON0_DACNSS_POSITION                 equ 0000h
DAC1CON0_DACNSS_SIZE                     equ 0002h
DAC1CON0_DACNSS_LENGTH                   equ 0002h
DAC1CON0_DACNSS_MASK                     equ 0003h
DAC1CON0_DACPSS_POSN                     equ 0002h
DAC1CON0_DACPSS_POSITION                 equ 0002h
DAC1CON0_DACPSS_SIZE                     equ 0002h
DAC1CON0_DACPSS_LENGTH                   equ 0002h
DAC1CON0_DACPSS_MASK                     equ 000Ch
DAC1CON0_DACOE1_POSN                     equ 0005h
DAC1CON0_DACOE1_POSITION                 equ 0005h
DAC1CON0_DACOE1_SIZE                     equ 0001h
DAC1CON0_DACOE1_LENGTH                   equ 0001h
DAC1CON0_DACOE1_MASK                     equ 0020h
DAC1CON0_DACFM_POSN                      equ 0006h
DAC1CON0_DACFM_POSITION                  equ 0006h
DAC1CON0_DACFM_SIZE                      equ 0001h
DAC1CON0_DACFM_LENGTH                    equ 0001h
DAC1CON0_DACFM_MASK                      equ 0040h
DAC1CON0_DACEN_POSN                      equ 0007h
DAC1CON0_DACEN_POSITION                  equ 0007h
DAC1CON0_DACEN_SIZE                      equ 0001h
DAC1CON0_DACEN_LENGTH                    equ 0001h
DAC1CON0_DACEN_MASK                      equ 0080h
DAC1CON0_DACNSS0_POSN                    equ 0000h
DAC1CON0_DACNSS0_POSITION                equ 0000h
DAC1CON0_DACNSS0_SIZE                    equ 0001h
DAC1CON0_DACNSS0_LENGTH                  equ 0001h
DAC1CON0_DACNSS0_MASK                    equ 0001h
DAC1CON0_DACPSS0_POSN                    equ 0002h
DAC1CON0_DACPSS0_POSITION                equ 0002h
DAC1CON0_DACPSS0_SIZE                    equ 0001h
DAC1CON0_DACPSS0_LENGTH                  equ 0001h
DAC1CON0_DACPSS0_MASK                    equ 0004h
DAC1CON0_DACPSS1_POSN                    equ 0003h
DAC1CON0_DACPSS1_POSITION                equ 0003h
DAC1CON0_DACPSS1_SIZE                    equ 0001h
DAC1CON0_DACPSS1_LENGTH                  equ 0001h
DAC1CON0_DACPSS1_MASK                    equ 0008h
DAC1CON0_DACOE_POSN                      equ 0005h
DAC1CON0_DACOE_POSITION                  equ 0005h
DAC1CON0_DACOE_SIZE                      equ 0001h
DAC1CON0_DACOE_LENGTH                    equ 0001h
DAC1CON0_DACOE_MASK                      equ 0020h
DAC1CON0_DAC1NSS_POSN                    equ 0000h
DAC1CON0_DAC1NSS_POSITION                equ 0000h
DAC1CON0_DAC1NSS_SIZE                    equ 0002h
DAC1CON0_DAC1NSS_LENGTH                  equ 0002h
DAC1CON0_DAC1NSS_MASK                    equ 0003h
DAC1CON0_DAC1PSS_POSN                    equ 0002h
DAC1CON0_DAC1PSS_POSITION                equ 0002h
DAC1CON0_DAC1PSS_SIZE                    equ 0002h
DAC1CON0_DAC1PSS_LENGTH                  equ 0002h
DAC1CON0_DAC1PSS_MASK                    equ 000Ch
DAC1CON0_DAC1OE1_POSN                    equ 0005h
DAC1CON0_DAC1OE1_POSITION                equ 0005h
DAC1CON0_DAC1OE1_SIZE                    equ 0001h
DAC1CON0_DAC1OE1_LENGTH                  equ 0001h
DAC1CON0_DAC1OE1_MASK                    equ 0020h
DAC1CON0_DAC1FM_POSN                     equ 0006h
DAC1CON0_DAC1FM_POSITION                 equ 0006h
DAC1CON0_DAC1FM_SIZE                     equ 0001h
DAC1CON0_DAC1FM_LENGTH                   equ 0001h
DAC1CON0_DAC1FM_MASK                     equ 0040h
DAC1CON0_DAC1EN_POSN                     equ 0007h
DAC1CON0_DAC1EN_POSITION                 equ 0007h
DAC1CON0_DAC1EN_SIZE                     equ 0001h
DAC1CON0_DAC1EN_LENGTH                   equ 0001h
DAC1CON0_DAC1EN_MASK                     equ 0080h
DAC1CON0_DAC1NSS0_POSN                   equ 0000h
DAC1CON0_DAC1NSS0_POSITION               equ 0000h
DAC1CON0_DAC1NSS0_SIZE                   equ 0001h
DAC1CON0_DAC1NSS0_LENGTH                 equ 0001h
DAC1CON0_DAC1NSS0_MASK                   equ 0001h
DAC1CON0_DAC1PSS0_POSN                   equ 0002h
DAC1CON0_DAC1PSS0_POSITION               equ 0002h
DAC1CON0_DAC1PSS0_SIZE                   equ 0001h
DAC1CON0_DAC1PSS0_LENGTH                 equ 0001h
DAC1CON0_DAC1PSS0_MASK                   equ 0004h
DAC1CON0_DAC1PSS1_POSN                   equ 0003h
DAC1CON0_DAC1PSS1_POSITION               equ 0003h
DAC1CON0_DAC1PSS1_SIZE                   equ 0001h
DAC1CON0_DAC1PSS1_LENGTH                 equ 0001h
DAC1CON0_DAC1PSS1_MASK                   equ 0008h

