GopalSaraf/Practicals/PSDL/include/proc/pic16f1768.inc
// Register: COG1DBF
#define COG1DBF COG1DBF
COG1DBF                                  equ 0692h
// bitfield definitions
COG1DBF_DBF0_POSN                        equ 0000h
COG1DBF_DBF0_POSITION                    equ 0000h
COG1DBF_DBF0_SIZE                        equ 0001h
COG1DBF_DBF0_LENGTH                      equ 0001h
COG1DBF_DBF0_MASK                        equ 0001h
COG1DBF_DBF1_POSN                        equ 0001h
COG1DBF_DBF1_POSITION                    equ 0001h
COG1DBF_DBF1_SIZE                        equ 0001h
COG1DBF_DBF1_LENGTH                      equ 0001h
COG1DBF_DBF1_MASK                        equ 0002h
COG1DBF_DBF2_POSN                        equ 0002h
COG1DBF_DBF2_POSITION                    equ 0002h
COG1DBF_DBF2_SIZE                        equ 0001h
COG1DBF_DBF2_LENGTH                      equ 0001h
COG1DBF_DBF2_MASK                        equ 0004h
COG1DBF_DBF3_POSN                        equ 0003h
COG1DBF_DBF3_POSITION                    equ 0003h
COG1DBF_DBF3_SIZE                        equ 0001h
COG1DBF_DBF3_LENGTH                      equ 0001h
COG1DBF_DBF3_MASK                        equ 0008h
COG1DBF_DBF4_POSN                        equ 0004h
COG1DBF_DBF4_POSITION                    equ 0004h
COG1DBF_DBF4_SIZE                        equ 0001h
COG1DBF_DBF4_LENGTH                      equ 0001h
COG1DBF_DBF4_MASK                        equ 0010h
COG1DBF_DBF5_POSN                        equ 0005h
COG1DBF_DBF5_POSITION                    equ 0005h
COG1DBF_DBF5_SIZE                        equ 0001h
COG1DBF_DBF5_LENGTH                      equ 0001h
COG1DBF_DBF5_MASK                        equ 0020h
COG1DBF_G1DBF0_POSN                      equ 0000h
COG1DBF_G1DBF0_POSITION                  equ 0000h
COG1DBF_G1DBF0_SIZE                      equ 0001h
COG1DBF_G1DBF0_LENGTH                    equ 0001h
COG1DBF_G1DBF0_MASK                      equ 0001h
COG1DBF_G1DBF1_POSN                      equ 0001h
COG1DBF_G1DBF1_POSITION                  equ 0001h
COG1DBF_G1DBF1_SIZE                      equ 0001h
COG1DBF_G1DBF1_LENGTH                    equ 0001h
COG1DBF_G1DBF1_MASK                      equ 0002h
COG1DBF_G1DBF2_POSN                      equ 0002h
COG1DBF_G1DBF2_POSITION                  equ 0002h
COG1DBF_G1DBF2_SIZE                      equ 0001h
COG1DBF_G1DBF2_LENGTH                    equ 0001h
COG1DBF_G1DBF2_MASK                      equ 0004h
COG1DBF_G1DBF3_POSN                      equ 0003h
COG1DBF_G1DBF3_POSITION                  equ 0003h
COG1DBF_G1DBF3_SIZE                      equ 0001h
COG1DBF_G1DBF3_LENGTH                    equ 0001h
COG1DBF_G1DBF3_MASK                      equ 0008h
COG1DBF_G1DBF4_POSN                      equ 0004h
COG1DBF_G1DBF4_POSITION                  equ 0004h
COG1DBF_G1DBF4_SIZE                      equ 0001h
COG1DBF_G1DBF4_LENGTH                    equ 0001h
COG1DBF_G1DBF4_MASK                      equ 0010h
COG1DBF_G1DBF5_POSN                      equ 0005h
COG1DBF_G1DBF5_POSITION                  equ 0005h
COG1DBF_G1DBF5_SIZE                      equ 0001h
COG1DBF_G1DBF5_LENGTH                    equ 0001h
COG1DBF_G1DBF5_MASK                      equ 0020h
COG1DBF_G1DBF_POSN                       equ 0000h
COG1DBF_G1DBF_POSITION                   equ 0000h
COG1DBF_G1DBF_SIZE                       equ 0006h
COG1DBF_G1DBF_LENGTH                     equ 0006h
COG1DBF_G1DBF_MASK                       equ 003Fh

// Register: COG1CON0
#define COG1CON0 COG1CON0
COG1CON0                                 equ 0693h
// bitfield definitions
COG1CON0_MD_POSN                         equ 0000h
COG1CON0_MD_POSITION                     equ 0000h
COG1CON0_MD_SIZE                         equ 0003h
COG1CON0_MD_LENGTH                       equ 0003h
COG1CON0_MD_MASK                         equ 0007h
COG1CON0_CS_POSN                         equ 0003h
COG1CON0_CS_POSITION                     equ 0003h
COG1CON0_CS_SIZE                         equ 0002h
COG1CON0_CS_LENGTH                       equ 0002h
COG1CON0_CS_MASK                         equ 0018h
COG1CON0_LD_POSN                         equ 0006h
COG1CON0_LD_POSITION                     equ 0006h
COG1CON0_LD_SIZE                         equ 0001h
COG1CON0_LD_LENGTH                       equ 0001h
COG1CON0_LD_MASK                         equ 0040h
COG1CON0_EN_POSN                         equ 0007h
COG1CON0_EN_POSITION                     equ 0007h
COG1CON0_EN_SIZE                         equ 0001h
COG1CON0_EN_LENGTH                       equ 0001h
COG1CON0_EN_MASK                         equ 0080h
COG1CON0_MD0_POSN                        equ 0000h
COG1CON0_MD0_POSITION                    equ 0000h
COG1CON0_MD0_SIZE                        equ 0001h
COG1CON0_MD0_LENGTH                      equ 0001h
COG1CON0_MD0_MASK                        equ 0001h
COG1CON0_MD1_POSN                        equ 0001h
COG1CON0_MD1_POSITION                    equ 0001h
COG1CON0_MD1_SIZE                        equ 0001h
COG1CON0_MD1_LENGTH                      equ 0001h
COG1CON0_MD1_MASK                        equ 0002h
COG1CON0_MD2_POSN                        equ 0002h
COG1CON0_MD2_POSITION                    equ 0002h
COG1CON0_MD2_SIZE                        equ 0001h
COG1CON0_MD2_LENGTH                      equ 0001h
COG1CON0_MD2_MASK                        equ 0004h
COG1CON0_CS0_POSN                        equ 0003h
COG1CON0_CS0_POSITION                    equ 0003h
COG1CON0_CS0_SIZE                        equ 0001h
COG1CON0_CS0_LENGTH                      equ 0001h
COG1CON0_CS0_MASK                        equ 0008h
COG1CON0_CS1_POSN                        equ 0004h
COG1CON0_CS1_POSITION                    equ 0004h
COG1CON0_CS1_SIZE                        equ 0001h
COG1CON0_CS1_LENGTH                      equ 0001h
COG1CON0_CS1_MASK                        equ 0010h
COG1CON0_G1MD_POSN                       equ 0000h
COG1CON0_G1MD_POSITION                   equ 0000h
COG1CON0_G1MD_SIZE                       equ 0003h
COG1CON0_G1MD_LENGTH                     equ 0003h
COG1CON0_G1MD_MASK                       equ 0007h
COG1CON0_G1CS_POSN                       equ 0003h
COG1CON0_G1CS_POSITION                   equ 0003h
COG1CON0_G1CS_SIZE                       equ 0002h
COG1CON0_G1CS_LENGTH                     equ 0002h
COG1CON0_G1CS_MASK                       equ 0018h
COG1CON0_G1LD_POSN                       equ 0006h
COG1CON0_G1LD_POSITION                   equ 0006h
COG1CON0_G1LD_SIZE                       equ 0001h
COG1CON0_G1LD_LENGTH                     equ 0001h
COG1CON0_G1LD_MASK                       equ 0040h
COG1CON0_G1EN_POSN                       equ 0007h
COG1CON0_G1EN_POSITION                   equ 0007h
COG1CON0_G1EN_SIZE                       equ 0001h
COG1CON0_G1EN_LENGTH                     equ 0001h
COG1CON0_G1EN_MASK                       equ 0080h
COG1CON0_G1MD0_POSN                      equ 0000h
COG1CON0_G1MD0_POSITION                  equ 0000h
COG1CON0_G1MD0_SIZE                      equ 0001h
COG1CON0_G1MD0_LENGTH                    equ 0001h
COG1CON0_G1MD0_MASK                      equ 0001h
COG1CON0_G1MD1_POSN                      equ 0001h
COG1CON0_G1MD1_POSITION                  equ 0001h
COG1CON0_G1MD1_SIZE                      equ 0001h
COG1CON0_G1MD1_LENGTH                    equ 0001h
COG1CON0_G1MD1_MASK                      equ 0002h
COG1CON0_G1MD2_POSN                      equ 0002h
COG1CON0_G1MD2_POSITION                  equ 0002h
COG1CON0_G1MD2_SIZE                      equ 0001h
COG1CON0_G1MD2_LENGTH                    equ 0001h
COG1CON0_G1MD2_MASK                      equ 0004h
COG1CON0_G1CS0_POSN                      equ 0003h
COG1CON0_G1CS0_POSITION                  equ 0003h
COG1CON0_G1CS0_SIZE                      equ 0001h
COG1CON0_G1CS0_LENGTH                    equ 0001h
COG1CON0_G1CS0_MASK                      equ 0008h
COG1CON0_G1CS1_POSN                      equ 0004h
COG1CON0_G1CS1_POSITION                  equ 0004h
COG1CON0_G1CS1_SIZE                      equ 0001h
COG1CON0_G1CS1_LENGTH                    equ 0001h
COG1CON0_G1CS1_MASK                      equ 0010h

// Register: COG1CON1
#define COG1CON1 COG1CON1
COG1CON1                                 equ 0694h
// bitfield definitions
COG1CON1_POLA_POSN                       equ 0000h
COG1CON1_POLA_POSITION                   equ 0000h
COG1CON1_POLA_SIZE                       equ 0001h
COG1CON1_POLA_LENGTH                     equ 0001h
COG1CON1_POLA_MASK                       equ 0001h
COG1CON1_POLB_POSN                       equ 0001h
COG1CON1_POLB_POSITION                   equ 0001h
COG1CON1_POLB_SIZE                       equ 0001h
COG1CON1_POLB_LENGTH                     equ 0001h
COG1CON1_POLB_MASK                       equ 0002h
COG1CON1_POLC_POSN                       equ 0002h
COG1CON1_POLC_POSITION                   equ 0002h
COG1CON1_POLC_SIZE                       equ 0001h
COG1CON1_POLC_LENGTH                     equ 0001h
COG1CON1_POLC_MASK                       equ 0004h
COG1CON1_POLD_POSN                       equ 0003h
COG1CON1_POLD_POSITION                   equ 0003h
COG1CON1_POLD_SIZE                       equ 0001h
COG1CON1_POLD_LENGTH                     equ 0001h
COG1CON1_POLD_MASK                       equ 0008h
COG1CON1_FDBS_POSN                       equ 0006h
COG1CON1_FDBS_POSITION                   equ 0006h
COG1CON1_FDBS_SIZE                       equ 0001h
COG1CON1_FDBS_LENGTH                     equ 0001h
COG1CON1_FDBS_MASK                       equ 0040h
COG1CON1_RDBS_POSN                       equ 0007h
COG1CON1_RDBS_POSITION                   equ 0007h
COG1CON1_RDBS_SIZE                       equ 0001h
COG1CON1_RDBS_LENGTH                     equ 0001h
COG1CON1_RDBS_MASK                       equ 0080h
COG1CON1_G1POLA_POSN                     equ 0000h
COG1CON1_G1POLA_POSITION                 equ 0000h
COG1CON1_G1POLA_SIZE                     equ 0001h
COG1CON1_G1POLA_LENGTH                   equ 0001h
COG1CON1_G1POLA_MASK                     equ 0001h
COG1CON1_G1POLB_POSN                     equ 0001h
COG1CON1_G1POLB_POSITION                 equ 0001h
COG1CON1_G1POLB_SIZE                     equ 0001h
COG1CON1_G1POLB_LENGTH                   equ 0001h
COG1CON1_G1POLB_MASK                     equ 0002h
COG1CON1_G1POLC_POSN                     equ 0002h
COG1CON1_G1POLC_POSITION                 equ 0002h
COG1CON1_G1POLC_SIZE                     equ 0001h
COG1CON1_G1POLC_LENGTH                   equ 0001h
COG1CON1_G1POLC_MASK                     equ 0004h
COG1CON1_G1POLD_POSN                     equ 0003h
COG1CON1_G1POLD_POSITION                 equ 0003h
COG1CON1_G1POLD_SIZE                     equ 0001h
COG1CON1_G1POLD_LENGTH                   equ 0001h
COG1CON1_G1POLD_MASK                     equ 0008h
COG1CON1_G1FDBS_POSN                     equ 0006h
COG1CON1_G1FDBS_POSITION                 equ 0006h
COG1CON1_G1FDBS_SIZE                     equ 0001h
COG1CON1_G1FDBS_LENGTH                   equ 0001h
COG1CON1_G1FDBS_MASK                     equ 0040h
COG1CON1_G1RDBS_POSN                     equ 0007h
COG1CON1_G1RDBS_POSITION                 equ 0007h
COG1CON1_G1RDBS_SIZE                     equ 0001h
COG1CON1_G1RDBS_LENGTH                   equ 0001h
COG1CON1_G1RDBS_MASK                     equ 0080h

// Register: COG1RIS0
#define COG1RIS0 COG1RIS0
COG1RIS0                                 equ 0695h
// bitfield definitions
COG1RIS0_RIS0_POSN                       equ 0000h
COG1RIS0_RIS0_POSITION                   equ 0000h
COG1RIS0_RIS0_SIZE                       equ 0001h
COG1RIS0_RIS0_LENGTH                     equ 0001h
COG1RIS0_RIS0_MASK                       equ 0001h
COG1RIS0_RIS1_POSN                       equ 0001h
COG1RIS0_RIS1_POSITION                   equ 0001h
COG1RIS0_RIS1_SIZE                       equ 0001h
COG1RIS0_RIS1_LENGTH                     equ 0001h
COG1RIS0_RIS1_MASK                       equ 0002h
COG1RIS0_RIS2_POSN                       equ 0002h
COG1RIS0_RIS2_POSITION                   equ 0002h
COG1RIS0_RIS2_SIZE                       equ 0001h
COG1RIS0_RIS2_LENGTH                     equ 0001h
COG1RIS0_RIS2_MASK                       equ 0004h
COG1RIS0_RIS3_POSN                       equ 0003h
COG1RIS0_RIS3_POSITION                   equ 0003h
COG1RIS0_RIS3_SIZE                       equ 0001h
COG1RIS0_RIS3_LENGTH                     equ 0001h
COG1RIS0_RIS3_MASK                       equ 0008h
COG1RIS0_RIS4_POSN                       equ 0004h
COG1RIS0_RIS4_POSITION                   equ 0004h
COG1RIS0_RIS4_SIZE                       equ 0001h
COG1RIS0_RIS4_LENGTH                     equ 0001h
COG1RIS0_RIS4_MASK                       equ 0010h
COG1RIS0_RIS5_POSN                       equ 0005h
COG1RIS0_RIS5_POSITION                   equ 0005h
COG1RIS0_RIS5_SIZE                       equ 0001h
COG1RIS0_RIS5_LENGTH                     equ 0001h
COG1RIS0_RIS5_MASK                       equ 0020h
COG1RIS0_RIS6_POSN                       equ 0006h
COG1RIS0_RIS6_POSITION                   equ 0006h
COG1RIS0_RIS6_SIZE                       equ 0001h
COG1RIS0_RIS6_LENGTH                     equ 0001h
COG1RIS0_RIS6_MASK                       equ 0040h
COG1RIS0_RIS7_POSN                       equ 0007h
COG1RIS0_RIS7_POSITION                   equ 0007h
COG1RIS0_RIS7_SIZE                       equ 0001h
COG1RIS0_RIS7_LENGTH                     equ 0001h
COG1RIS0_RIS7_MASK                       equ 0080h
COG1RIS0_G1RIS0_POSN                     equ 0000h
COG1RIS0_G1RIS0_POSITION                 equ 0000h
COG1RIS0_G1RIS0_SIZE                     equ 0001h
COG1RIS0_G1RIS0_LENGTH                   equ 0001h
COG1RIS0_G1RIS0_MASK                     equ 0001h
COG1RIS0_G1RIS1_POSN                     equ 0001h
COG1RIS0_G1RIS1_POSITION                 equ 0001h
COG1RIS0_G1RIS1_SIZE                     equ 0001h
COG1RIS0_G1RIS1_LENGTH                   equ 0001h
COG1RIS0_G1RIS1_MASK                     equ 0002h
COG1RIS0_G1RIS2_POSN                     equ 0002h
COG1RIS0_G1RIS2_POSITION                 equ 0002h
COG1RIS0_G1RIS2_SIZE                     equ 0001h
COG1RIS0_G1RIS2_LENGTH                   equ 0001h
COG1RIS0_G1RIS2_MASK                     equ 0004h
COG1RIS0_G1RIS3_POSN                     equ 0003h
COG1RIS0_G1RIS3_POSITION                 equ 0003h
COG1RIS0_G1RIS3_SIZE                     equ 0001h
COG1RIS0_G1RIS3_LENGTH                   equ 0001h
COG1RIS0_G1RIS3_MASK                     equ 0008h
COG1RIS0_G1RIS4_POSN                     equ 0004h
COG1RIS0_G1RIS4_POSITION                 equ 0004h
COG1RIS0_G1RIS4_SIZE                     equ 0001h
COG1RIS0_G1RIS4_LENGTH                   equ 0001h
COG1RIS0_G1RIS4_MASK                     equ 0010h
COG1RIS0_G1RIS5_POSN                     equ 0005h
COG1RIS0_G1RIS5_POSITION                 equ 0005h
COG1RIS0_G1RIS5_SIZE                     equ 0001h
COG1RIS0_G1RIS5_LENGTH                   equ 0001h
COG1RIS0_G1RIS5_MASK                     equ 0020h
COG1RIS0_G1RIS6_POSN                     equ 0006h
COG1RIS0_G1RIS6_POSITION                 equ 0006h
COG1RIS0_G1RIS6_SIZE                     equ 0001h
COG1RIS0_G1RIS6_LENGTH                   equ 0001h
COG1RIS0_G1RIS6_MASK                     equ 0040h
COG1RIS0_G1RIS7_POSN                     equ 0007h
COG1RIS0_G1RIS7_POSITION                 equ 0007h
COG1RIS0_G1RIS7_SIZE                     equ 0001h
COG1RIS0_G1RIS7_LENGTH                   equ 0001h
COG1RIS0_G1RIS7_MASK                     equ 0080h

// Register: COG1RIS1
#define COG1RIS1 COG1RIS1
COG1RIS1                                 equ 0696h
// bitfield definitions
COG1RIS1_RIS8_POSN                       equ 0000h
COG1RIS1_RIS8_POSITION                   equ 0000h
COG1RIS1_RIS8_SIZE                       equ 0001h
COG1RIS1_RIS8_LENGTH                     equ 0001h
COG1RIS1_RIS8_MASK                       equ 0001h
COG1RIS1_RIS9_POSN                       equ 0001h
COG1RIS1_RIS9_POSITION                   equ 0001h
COG1RIS1_RIS9_SIZE                       equ 0001h
COG1RIS1_RIS9_LENGTH                     equ 0001h
COG1RIS1_RIS9_MASK                       equ 0002h
COG1RIS1_RIS10_POSN                      equ 0002h
COG1RIS1_RIS10_POSITION                  equ 0002h
COG1RIS1_RIS10_SIZE                      equ 0001h
COG1RIS1_RIS10_LENGTH                    equ 0001h
COG1RIS1_RIS10_MASK                      equ 0004h
COG1RIS1_RIS11_POSN                      equ 0003h
COG1RIS1_RIS11_POSITION                  equ 0003h
COG1RIS1_RIS11_SIZE                      equ 0001h
COG1RIS1_RIS11_LENGTH                    equ 0001h
COG1RIS1_RIS11_MASK                      equ 0008h
COG1RIS1_RIS12_POSN                      equ 0004h
COG1RIS1_RIS12_POSITION                  equ 0004h
COG1RIS1_RIS12_SIZE                      equ 0001h
COG1RIS1_RIS12_LENGTH                    equ 0001h
COG1RIS1_RIS12_MASK                      equ 0010h
COG1RIS1_RIS13_POSN                      equ 0005h
COG1RIS1_RIS13_POSITION                  equ 0005h
COG1RIS1_RIS13_SIZE                      equ 0001h
COG1RIS1_RIS13_LENGTH                    equ 0001h
COG1RIS1_RIS13_MASK                      equ 0020h
COG1RIS1_RIS14_POSN                      equ 0006h
COG1RIS1_RIS14_POSITION                  equ 0006h
COG1RIS1_RIS14_SIZE                      equ 0001h
COG1RIS1_RIS14_LENGTH                    equ 0001h
COG1RIS1_RIS14_MASK                      equ 0040h
COG1RIS1_RIS15_POSN                      equ 0007h
COG1RIS1_RIS15_POSITION                  equ 0007h
COG1RIS1_RIS15_SIZE                      equ 0001h
COG1RIS1_RIS15_LENGTH                    equ 0001h
COG1RIS1_RIS15_MASK                      equ 0080h
COG1RIS1_G1RIS8_POSN                     equ 0000h
COG1RIS1_G1RIS8_POSITION                 equ 0000h
COG1RIS1_G1RIS8_SIZE                     equ 0001h
COG1RIS1_G1RIS8_LENGTH                   equ 0001h
COG1RIS1_G1RIS8_MASK                     equ 0001h
COG1RIS1_G1RIS9_POSN                     equ 0001h
COG1RIS1_G1RIS9_POSITION                 equ 0001h
COG1RIS1_G1RIS9_SIZE                     equ 0001h
COG1RIS1_G1RIS9_LENGTH                   equ 0001h
COG1RIS1_G1RIS9_MASK                     equ 0002h
COG1RIS1_G1RIS10_POSN                    equ 0002h
COG1RIS1_G1RIS10_POSITION                equ 0002h
COG1RIS1_G1RIS10_SIZE                    equ 0001h
COG1RIS1_G1RIS10_LENGTH                  equ 0001h
COG1RIS1_G1RIS10_MASK                    equ 0004h
COG1RIS1_G1RIS11_POSN                    equ 0003h
COG1RIS1_G1RIS11_POSITION                equ 0003h
COG1RIS1_G1RIS11_SIZE                    equ 0001h
COG1RIS1_G1RIS11_LENGTH                  equ 0001h
COG1RIS1_G1RIS11_MASK                    equ 0008h
COG1RIS1_G1RIS12_POSN                    equ 0004h
COG1RIS1_G1RIS12_POSITION                equ 0004h
COG1RIS1_G1RIS12_SIZE                    equ 0001h
COG1RIS1_G1RIS12_LENGTH                  equ 0001h
COG1RIS1_G1RIS12_MASK                    equ 0010h
COG1RIS1_G1RIS13_POSN                    equ 0005h
COG1RIS1_G1RIS13_POSITION                equ 0005h
COG1RIS1_G1RIS13_SIZE                    equ 0001h
COG1RIS1_G1RIS13_LENGTH                  equ 0001h
COG1RIS1_G1RIS13_MASK                    equ 0020h
COG1RIS1_G1RIS14_POSN                    equ 0006h
COG1RIS1_G1RIS14_POSITION                equ 0006h
COG1RIS1_G1RIS14_SIZE                    equ 0001h
COG1RIS1_G1RIS14_LENGTH                  equ 0001h
COG1RIS1_G1RIS14_MASK                    equ 0040h
COG1RIS1_G1RIS15_POSN                    equ 0007h
COG1RIS1_G1RIS15_POSITION                equ 0007h
COG1RIS1_G1RIS15_SIZE                    equ 0001h
COG1RIS1_G1RIS15_LENGTH                  equ 0001h
COG1RIS1_G1RIS15_MASK                    equ 0080h

// Register: COG1RSIM0
#define COG1RSIM0 COG1RSIM0
COG1RSIM0                                equ 0697h
// bitfield definitions
COG1RSIM0_RSIM0_POSN                     equ 0000h
COG1RSIM0_RSIM0_POSITION                 equ 0000h
COG1RSIM0_RSIM0_SIZE                     equ 0001h
COG1RSIM0_RSIM0_LENGTH                   equ 0001h
COG1RSIM0_RSIM0_MASK                     equ 0001h
COG1RSIM0_RSIM1_POSN                     equ 0001h
COG1RSIM0_RSIM1_POSITION                 equ 0001h
COG1RSIM0_RSIM1_SIZE                     equ 0001h
COG1RSIM0_RSIM1_LENGTH                   equ 0001h
COG1RSIM0_RSIM1_MASK                     equ 0002h
COG1RSIM0_RSIM2_POSN                     equ 0002h
COG1RSIM0_RSIM2_POSITION                 equ 0002h
COG1RSIM0_RSIM2_SIZE                     equ 0001h
COG1RSIM0_RSIM2_LENGTH                   equ 0001h
COG1RSIM0_RSIM2_MASK                     equ 0004h
COG1RSIM0_RSIM3_POSN                     equ 0003h
COG1RSIM0_RSIM3_POSITION                 equ 0003h
COG1RSIM0_RSIM3_SIZE                     equ 0001h
COG1RSIM0_RSIM3_LENGTH                   equ 0001h
COG1RSIM0_RSIM3_MASK                     equ 0008h
COG1RSIM0_RSIM4_POSN                     equ 0004h
COG1RSIM0_RSIM4_POSITION                 equ 0004h
COG1RSIM0_RSIM4_SIZE                     equ 0001h
COG1RSIM0_RSIM4_LENGTH                   equ 0001h
COG1RSIM0_RSIM4_MASK                     equ 0010h
COG1RSIM0_RSIM5_POSN                     equ 0005h
COG1RSIM0_RSIM5_POSITION                 equ 0005h
COG1RSIM0_RSIM5_SIZE                     equ 0001h
COG1RSIM0_RSIM5_LENGTH                   equ 0001h
COG1RSIM0_RSIM5_MASK                     equ 0020h
COG1RSIM0_RSIM6_POSN                     equ 0006h
COG1RSIM0_RSIM6_POSITION                 equ 0006h
COG1RSIM0_RSIM6_SIZE                     equ 0001h
COG1RSIM0_RSIM6_LENGTH                   equ 0001h
COG1RSIM0_RSIM6_MASK                     equ 0040h
COG1RSIM0_RSIM7_POSN                     equ 0007h
COG1RSIM0_RSIM7_POSITION                 equ 0007h
COG1RSIM0_RSIM7_SIZE                     equ 0001h
COG1RSIM0_RSIM7_LENGTH                   equ 0001h
COG1RSIM0_RSIM7_MASK                     equ 0080h
COG1RSIM0_G1RSIM0_POSN                   equ 0000h
COG1RSIM0_G1RSIM0_POSITION               equ 0000h
COG1RSIM0_G1RSIM0_SIZE                   equ 0001h
COG1RSIM0_G1RSIM0_LENGTH                 equ 0001h
COG1RSIM0_G1RSIM0_MASK                   equ 0001h
COG1RSIM0_G1RSIM1_POSN                   equ 0001h
COG1RSIM0_G1RSIM1_POSITION               equ 0001h
COG1RSIM0_G1RSIM1_SIZE                   equ 0001h
COG1RSIM0_G1RSIM1_LENGTH                 equ 0001h
COG1RSIM0_G1RSIM1_MASK                   equ 0002h
COG1RSIM0_G1RSIM2_POSN                   equ 0002h
COG1RSIM0_G1RSIM2_POSITION               equ 0002h
COG1RSIM0_G1RSIM2_SIZE                   equ 0001h
COG1RSIM0_G1RSIM2_LENGTH                 equ 0001h
COG1RSIM0_G1RSIM2_MASK                   equ 0004h
COG1RSIM0_G1RSIM3_POSN                   equ 0003h
COG1RSIM0_G1RSIM3_POSITION               equ 0003h
COG1RSIM0_G1RSIM3_SIZE                   equ 0001h
COG1RSIM0_G1RSIM3_LENGTH                 equ 0001h
COG1RSIM0_G1RSIM3_MASK                   equ 0008h
COG1RSIM0_G1RSIM4_POSN                   equ 0004h
COG1RSIM0_G1RSIM4_POSITION               equ 0004h
COG1RSIM0_G1RSIM4_SIZE                   equ 0001h
COG1RSIM0_G1RSIM4_LENGTH                 equ 0001h
COG1RSIM0_G1RSIM4_MASK                   equ 0010h
COG1RSIM0_G1RSIM5_POSN                   equ 0005h
COG1RSIM0_G1RSIM5_POSITION               equ 0005h
COG1RSIM0_G1RSIM5_SIZE                   equ 0001h
COG1RSIM0_G1RSIM5_LENGTH                 equ 0001h
COG1RSIM0_G1RSIM5_MASK                   equ 0020h
COG1RSIM0_G1RSIM6_POSN                   equ 0006h
COG1RSIM0_G1RSIM6_POSITION               equ 0006h
COG1RSIM0_G1RSIM6_SIZE                   equ 0001h
COG1RSIM0_G1RSIM6_LENGTH                 equ 0001h
COG1RSIM0_G1RSIM6_MASK                   equ 0040h
COG1RSIM0_G1RSIM7_POSN                   equ 0007h
COG1RSIM0_G1RSIM7_POSITION               equ 0007h
COG1RSIM0_G1RSIM7_SIZE                   equ 0001h
COG1RSIM0_G1RSIM7_LENGTH                 equ 0001h
COG1RSIM0_G1RSIM7_MASK                   equ 0080h

