GopalSaraf/Practicals/PSDL/include/proc/pic16f1768.inc
// Register: PWM6OFCON
#define PWM6OFCON PWM6OFCON
PWM6OFCON                                equ 0DB0h
// bitfield definitions
PWM6OFCON_OFS_POSN                       equ 0000h
PWM6OFCON_OFS_POSITION                   equ 0000h
PWM6OFCON_OFS_SIZE                       equ 0002h
PWM6OFCON_OFS_LENGTH                     equ 0002h
PWM6OFCON_OFS_MASK                       equ 0003h
PWM6OFCON_OFO_POSN                       equ 0004h
PWM6OFCON_OFO_POSITION                   equ 0004h
PWM6OFCON_OFO_SIZE                       equ 0001h
PWM6OFCON_OFO_LENGTH                     equ 0001h
PWM6OFCON_OFO_MASK                       equ 0010h
PWM6OFCON_OFM_POSN                       equ 0005h
PWM6OFCON_OFM_POSITION                   equ 0005h
PWM6OFCON_OFM_SIZE                       equ 0002h
PWM6OFCON_OFM_LENGTH                     equ 0002h
PWM6OFCON_OFM_MASK                       equ 0060h
PWM6OFCON_PWM6OFS0_POSN                  equ 0000h
PWM6OFCON_PWM6OFS0_POSITION              equ 0000h
PWM6OFCON_PWM6OFS0_SIZE                  equ 0001h
PWM6OFCON_PWM6OFS0_LENGTH                equ 0001h
PWM6OFCON_PWM6OFS0_MASK                  equ 0001h
PWM6OFCON_PWM6OFM0_POSN                  equ 0005h
PWM6OFCON_PWM6OFM0_POSITION              equ 0005h
PWM6OFCON_PWM6OFM0_SIZE                  equ 0001h
PWM6OFCON_PWM6OFM0_LENGTH                equ 0001h
PWM6OFCON_PWM6OFM0_MASK                  equ 0020h
PWM6OFCON_PWM6OFM1_POSN                  equ 0006h
PWM6OFCON_PWM6OFM1_POSITION              equ 0006h
PWM6OFCON_PWM6OFM1_SIZE                  equ 0001h
PWM6OFCON_PWM6OFM1_LENGTH                equ 0001h
PWM6OFCON_PWM6OFM1_MASK                  equ 0040h
PWM6OFCON_PWM6OFS_POSN                   equ 0000h
PWM6OFCON_PWM6OFS_POSITION               equ 0000h
PWM6OFCON_PWM6OFS_SIZE                   equ 0002h
PWM6OFCON_PWM6OFS_LENGTH                 equ 0002h
PWM6OFCON_PWM6OFS_MASK                   equ 0003h
PWM6OFCON_PWM6OFMC_POSN                  equ 0004h
PWM6OFCON_PWM6OFMC_POSITION              equ 0004h
PWM6OFCON_PWM6OFMC_SIZE                  equ 0001h
PWM6OFCON_PWM6OFMC_LENGTH                equ 0001h
PWM6OFCON_PWM6OFMC_MASK                  equ 0010h
PWM6OFCON_PWM6OFM_POSN                   equ 0005h
PWM6OFCON_PWM6OFM_POSITION               equ 0005h
PWM6OFCON_PWM6OFM_SIZE                   equ 0002h
PWM6OFCON_PWM6OFM_LENGTH                 equ 0002h
PWM6OFCON_PWM6OFM_MASK                   equ 0060h
PWM6OFCON_OFS0_POSN                      equ 0000h
PWM6OFCON_OFS0_POSITION                  equ 0000h
PWM6OFCON_OFS0_SIZE                      equ 0001h
PWM6OFCON_OFS0_LENGTH                    equ 0001h
PWM6OFCON_OFS0_MASK                      equ 0001h
PWM6OFCON_OFM0_POSN                      equ 0005h
PWM6OFCON_OFM0_POSITION                  equ 0005h
PWM6OFCON_OFM0_SIZE                      equ 0001h
PWM6OFCON_OFM0_LENGTH                    equ 0001h
PWM6OFCON_OFM0_MASK                      equ 0020h
PWM6OFCON_OFM1_POSN                      equ 0006h
PWM6OFCON_OFM1_POSITION                  equ 0006h
PWM6OFCON_OFM1_SIZE                      equ 0001h
PWM6OFCON_OFM1_LENGTH                    equ 0001h
PWM6OFCON_OFM1_MASK                      equ 0040h

// Register: PPSLOCK
#define PPSLOCK PPSLOCK
PPSLOCK                                  equ 0E0Fh
// bitfield definitions
PPSLOCK_PPSLOCKED_POSN                   equ 0000h
PPSLOCK_PPSLOCKED_POSITION               equ 0000h
PPSLOCK_PPSLOCKED_SIZE                   equ 0001h
PPSLOCK_PPSLOCKED_LENGTH                 equ 0001h
PPSLOCK_PPSLOCKED_MASK                   equ 0001h

// Register: INTPPS
#define INTPPS INTPPS
INTPPS                                   equ 0E10h
// bitfield definitions
INTPPS_INTPPS_POSN                       equ 0000h
INTPPS_INTPPS_POSITION                   equ 0000h
INTPPS_INTPPS_SIZE                       equ 0005h
INTPPS_INTPPS_LENGTH                     equ 0005h
INTPPS_INTPPS_MASK                       equ 001Fh

// Register: T0CKIPPS
#define T0CKIPPS T0CKIPPS
T0CKIPPS                                 equ 0E11h
// bitfield definitions
T0CKIPPS_T0CKIPPS_POSN                   equ 0000h
T0CKIPPS_T0CKIPPS_POSITION               equ 0000h
T0CKIPPS_T0CKIPPS_SIZE                   equ 0005h
T0CKIPPS_T0CKIPPS_LENGTH                 equ 0005h
T0CKIPPS_T0CKIPPS_MASK                   equ 001Fh

// Register: T1CKIPPS
#define T1CKIPPS T1CKIPPS
T1CKIPPS                                 equ 0E12h
// bitfield definitions
T1CKIPPS_T1CKIPPS_POSN                   equ 0000h
T1CKIPPS_T1CKIPPS_POSITION               equ 0000h
T1CKIPPS_T1CKIPPS_SIZE                   equ 0005h
T1CKIPPS_T1CKIPPS_LENGTH                 equ 0005h
T1CKIPPS_T1CKIPPS_MASK                   equ 001Fh

// Register: T1GPPS
#define T1GPPS T1GPPS
T1GPPS                                   equ 0E13h
// bitfield definitions
T1GPPS_T1GPPS_POSN                       equ 0000h
T1GPPS_T1GPPS_POSITION                   equ 0000h
T1GPPS_T1GPPS_SIZE                       equ 0005h
T1GPPS_T1GPPS_LENGTH                     equ 0005h
T1GPPS_T1GPPS_MASK                       equ 001Fh

// Register: CCP1PPS
#define CCP1PPS CCP1PPS
CCP1PPS                                  equ 0E14h
// bitfield definitions
CCP1PPS_CCP1PPS_POSN                     equ 0000h
CCP1PPS_CCP1PPS_POSITION                 equ 0000h
CCP1PPS_CCP1PPS_SIZE                     equ 0005h
CCP1PPS_CCP1PPS_LENGTH                   equ 0005h
CCP1PPS_CCP1PPS_MASK                     equ 001Fh

// Register: CCP2PPS
#define CCP2PPS CCP2PPS
CCP2PPS                                  equ 0E15h
// bitfield definitions
CCP2PPS_CCP2PPS_POSN                     equ 0000h
CCP2PPS_CCP2PPS_POSITION                 equ 0000h
CCP2PPS_CCP2PPS_SIZE                     equ 0005h
CCP2PPS_CCP2PPS_LENGTH                   equ 0005h
CCP2PPS_CCP2PPS_MASK                     equ 001Fh

// Register: COG1INPPS
#define COG1INPPS COG1INPPS
COG1INPPS                                equ 0E16h
// bitfield definitions
COG1INPPS_COG1INPPS_POSN                 equ 0000h
COG1INPPS_COG1INPPS_POSITION             equ 0000h
COG1INPPS_COG1INPPS_SIZE                 equ 0005h
COG1INPPS_COG1INPPS_LENGTH               equ 0005h
COG1INPPS_COG1INPPS_MASK                 equ 001Fh

// Register: COG2INPPS
#define COG2INPPS COG2INPPS
COG2INPPS                                equ 0E17h
// bitfield definitions
COG2INPPS_COG2INPPS_POSN                 equ 0000h
COG2INPPS_COG2INPPS_POSITION             equ 0000h
COG2INPPS_COG2INPPS_SIZE                 equ 0005h
COG2INPPS_COG2INPPS_LENGTH               equ 0005h
COG2INPPS_COG2INPPS_MASK                 equ 001Fh

