GopalSaraf/Practicals/PSDL/include/proc/pic16f1768.inc
#define PWM6OFH0                         BANKMASK(PWM6OFH), 0
#define PWM6OFH1                         BANKMASK(PWM6OFH), 1
#define PWM6OFH2                         BANKMASK(PWM6OFH), 2
#define PWM6OFH3                         BANKMASK(PWM6OFH), 3
#define PWM6OFH4                         BANKMASK(PWM6OFH), 4
#define PWM6OFH5                         BANKMASK(PWM6OFH), 5
#define PWM6OFH6                         BANKMASK(PWM6OFH), 6
#define PWM6OFH7                         BANKMASK(PWM6OFH), 7
#define PWM6OFIE                         BANKMASK(PWM6INTE), 3
#define PWM6OFIF                         BANKMASK(PWM6INTF), 3
#define PWM6OFL0                         BANKMASK(PWM6OFL), 0
#define PWM6OFL1                         BANKMASK(PWM6OFL), 1
#define PWM6OFL2                         BANKMASK(PWM6OFL), 2
#define PWM6OFL3                         BANKMASK(PWM6OFL), 3
#define PWM6OFL4                         BANKMASK(PWM6OFL), 4
#define PWM6OFL5                         BANKMASK(PWM6OFL), 5
#define PWM6OFL6                         BANKMASK(PWM6OFL), 6
#define PWM6OFL7                         BANKMASK(PWM6OFL), 7
#define PWM6OFM0                         BANKMASK(PWM6OFCON), 5
#define PWM6OFM1                         BANKMASK(PWM6OFCON), 6
#define PWM6OFMC                         BANKMASK(PWM6OFCON), 4
#define PWM6OFS0                         BANKMASK(PWM6OFCON), 0
#define PWM6OUT                          BANKMASK(PWM6CON), 5
#define PWM6PHH0                         BANKMASK(PWM6PHH), 0
#define PWM6PHH1                         BANKMASK(PWM6PHH), 1
#define PWM6PHH2                         BANKMASK(PWM6PHH), 2
#define PWM6PHH3                         BANKMASK(PWM6PHH), 3
#define PWM6PHH4                         BANKMASK(PWM6PHH), 4
#define PWM6PHH5                         BANKMASK(PWM6PHH), 5
#define PWM6PHH6                         BANKMASK(PWM6PHH), 6
#define PWM6PHH7                         BANKMASK(PWM6PHH), 7
#define PWM6PHIE                         BANKMASK(PWM6INTE), 2
#define PWM6PHIF                         BANKMASK(PWM6INTF), 2
#define PWM6PHL0                         BANKMASK(PWM6PHL), 0
#define PWM6PHL1                         BANKMASK(PWM6PHL), 1
#define PWM6PHL2                         BANKMASK(PWM6PHL), 2
#define PWM6PHL3                         BANKMASK(PWM6PHL), 3
#define PWM6PHL4                         BANKMASK(PWM6PHL), 4
#define PWM6PHL5                         BANKMASK(PWM6PHL), 5
#define PWM6PHL6                         BANKMASK(PWM6PHL), 6
#define PWM6PHL7                         BANKMASK(PWM6PHL), 7
#define PWM6POL                          BANKMASK(PWM6CON), 4
#define PWM6PRH0                         BANKMASK(PWM6PRH), 0
#define PWM6PRH1                         BANKMASK(PWM6PRH), 1
#define PWM6PRH2                         BANKMASK(PWM6PRH), 2
#define PWM6PRH3                         BANKMASK(PWM6PRH), 3
#define PWM6PRH4                         BANKMASK(PWM6PRH), 4
#define PWM6PRH5                         BANKMASK(PWM6PRH), 5
#define PWM6PRH6                         BANKMASK(PWM6PRH), 6
#define PWM6PRH7                         BANKMASK(PWM6PRH), 7
#define PWM6PRIE                         BANKMASK(PWM6INTE), 0
#define PWM6PRIF                         BANKMASK(PWM6INTF), 0
#define PWM6PRL0                         BANKMASK(PWM6PRL), 0
#define PWM6PRL1                         BANKMASK(PWM6PRL), 1
#define PWM6PRL2                         BANKMASK(PWM6PRL), 2
#define PWM6PRL3                         BANKMASK(PWM6PRL), 3
#define PWM6PRL4                         BANKMASK(PWM6PRL), 4
#define PWM6PRL5                         BANKMASK(PWM6PRL), 5
#define PWM6PRL6                         BANKMASK(PWM6PRL), 6
#define PWM6PRL7                         BANKMASK(PWM6PRL), 7
#define PWM6PS0                          BANKMASK(PWM6CLKCON), 4
#define PWM6PS1                          BANKMASK(PWM6CLKCON), 5
#define PWM6PS2                          BANKMASK(PWM6CLKCON), 6
#define PWM6TMRH0                        BANKMASK(PWM6TMRH), 0
#define PWM6TMRH1                        BANKMASK(PWM6TMRH), 1
#define PWM6TMRH2                        BANKMASK(PWM6TMRH), 2
#define PWM6TMRH3                        BANKMASK(PWM6TMRH), 3
#define PWM6TMRH4                        BANKMASK(PWM6TMRH), 4
#define PWM6TMRH5                        BANKMASK(PWM6TMRH), 5
#define PWM6TMRH6                        BANKMASK(PWM6TMRH), 6
#define PWM6TMRH7                        BANKMASK(PWM6TMRH), 7
#define PWM6TMRL0                        BANKMASK(PWM6TMRL), 0
#define PWM6TMRL1                        BANKMASK(PWM6TMRL), 1
#define PWM6TMRL2                        BANKMASK(PWM6TMRL), 2
#define PWM6TMRL3                        BANKMASK(PWM6TMRL), 3
#define PWM6TMRL4                        BANKMASK(PWM6TMRL), 4
#define PWM6TMRL5                        BANKMASK(PWM6TMRL), 5
#define PWM6TMRL6                        BANKMASK(PWM6TMRL), 6
#define PWM6TMRL7                        BANKMASK(PWM6TMRL), 7
#define RA0                              BANKMASK(PORTA), 0
#define RA1                              BANKMASK(PORTA), 1
#define RA2                              BANKMASK(PORTA), 2
#define RA3                              BANKMASK(PORTA), 3
#define RA4                              BANKMASK(PORTA), 4
#define RA5                              BANKMASK(PORTA), 5
#define RB4                              BANKMASK(PORTB), 4
#define RB5                              BANKMASK(PORTB), 5
#define RB6                              BANKMASK(PORTB), 6
#define RB7                              BANKMASK(PORTB), 7
#define RC0                              BANKMASK(PORTC), 0
#define RC1                              BANKMASK(PORTC), 1
#define RC2                              BANKMASK(PORTC), 2
#define RC3                              BANKMASK(PORTC), 3
#define RC4                              BANKMASK(PORTC), 4
#define RC5                              BANKMASK(PORTC), 5
#define RC6                              BANKMASK(PORTC), 6
#define RC7                              BANKMASK(PORTC), 7
#define RCEN                             BANKMASK(SSP1CON2), 3
#define RCIDL                            BANKMASK(BAUD1CON), 6
#define RCIE                             BANKMASK(PIE1), 5
#define RCIF                             BANKMASK(PIR1), 5
#define RD                               BANKMASK(PMCON1), 0
#define RG1EN                            BANKMASK(PRG1CON0), 7
#define RG1FEDG                          BANKMASK(PRG1CON0), 5
#define RG1FPOL                          BANKMASK(PRG1CON1), 1
#define RG1FTSS0                         BANKMASK(PRG1FTSS), 0
#define RG1FTSS1                         BANKMASK(PRG1FTSS), 1
#define RG1FTSS2                         BANKMASK(PRG1FTSS), 2
#define RG1FTSS3                         BANKMASK(PRG1FTSS), 3
#define RG1GO                            BANKMASK(PRG1CON0), 0
#define RG1INS0                          BANKMASK(PRG1INS), 0
#define RG1INS1                          BANKMASK(PRG1INS), 1
#define RG1INS2                          BANKMASK(PRG1INS), 2
#define RG1INS3                          BANKMASK(PRG1INS), 3
#define RG1ISET0                         BANKMASK(PRG1CON2), 0
#define RG1ISET1                         BANKMASK(PRG1CON2), 1
#define RG1ISET2                         BANKMASK(PRG1CON2), 2
#define RG1ISET3                         BANKMASK(PRG1CON2), 3
#define RG1ISET4                         BANKMASK(PRG1CON2), 4
#define RG1MODE0                         BANKMASK(PRG1CON0), 2
#define RG1MODE1                         BANKMASK(PRG1CON0), 3
#define RG1OS                            BANKMASK(PRG1CON0), 1
#define RG1RDY                           BANKMASK(PRG1CON1), 2
#define RG1REDG                          BANKMASK(PRG1CON0), 4
#define RG1RPOL                          BANKMASK(PRG1CON1), 0
#define RG1RTSS0                         BANKMASK(PRG1RTSS), 0
#define RG1RTSS1                         BANKMASK(PRG1RTSS), 1
#define RG1RTSS2                         BANKMASK(PRG1RTSS), 2
#define RG1RTSS3                         BANKMASK(PRG1RTSS), 3
#define RG2EN                            BANKMASK(PRG2CON0), 7
#define RG2FEDG                          BANKMASK(PRG2CON0), 5
#define RG2FPOL                          BANKMASK(PRG2CON1), 1
#define RG2FTSS0                         BANKMASK(PRG2FTSS), 0
#define RG2FTSS1                         BANKMASK(PRG2FTSS), 1
#define RG2FTSS2                         BANKMASK(PRG2FTSS), 2
#define RG2FTSS3                         BANKMASK(PRG2FTSS), 3
#define RG2GO                            BANKMASK(PRG2CON0), 0
#define RG2INS0                          BANKMASK(PRG2INS), 0
#define RG2INS1                          BANKMASK(PRG2INS), 1
#define RG2INS2                          BANKMASK(PRG2INS), 2
#define RG2INS3                          BANKMASK(PRG2INS), 3
#define RG2ISET0                         BANKMASK(PRG2CON2), 0
#define RG2ISET1                         BANKMASK(PRG2CON2), 1
#define RG2ISET2                         BANKMASK(PRG2CON2), 2
#define RG2ISET3                         BANKMASK(PRG2CON2), 3
#define RG2ISET4                         BANKMASK(PRG2CON2), 4
#define RG2MODE0                         BANKMASK(PRG2CON0), 2
#define RG2MODE1                         BANKMASK(PRG2CON0), 3
#define RG2OS                            BANKMASK(PRG2CON0), 1
#define RG2RDY                           BANKMASK(PRG2CON1), 2
#define RG2REDG                          BANKMASK(PRG2CON0), 4
#define RG2RPOL                          BANKMASK(PRG2CON1), 0
#define RG2RTSS0                         BANKMASK(PRG2RTSS), 0
#define RG2RTSS1                         BANKMASK(PRG2RTSS), 1
#define RG2RTSS2                         BANKMASK(PRG2RTSS), 2
#define RG2RTSS3                         BANKMASK(PRG2RTSS), 3
#define RSEN                             BANKMASK(SSP1CON2), 1
#define RX9                              BANKMASK(RC1STA), 6
#define RX9D                             BANKMASK(RC1STA), 0
#define R_nW                             BANKMASK(SSP1STAT), 2
#define SBCDE                            BANKMASK(SSP1CON3), 2
#define SBOREN                           BANKMASK(BORCON), 7
#define SCIE                             BANKMASK(SSP1CON3), 5
#define SCKP                             BANKMASK(BAUD1CON), 4
#define SCS0                             BANKMASK(OSCCON), 0
#define SCS1                             BANKMASK(OSCCON), 1
#define SDAHT                            BANKMASK(SSP1CON3), 3
#define SEN                              BANKMASK(SSP1CON2), 0
#define SENDB                            BANKMASK(TX1STA), 3
#define SLRA0                            BANKMASK(SLRCONA), 0
#define SLRA1                            BANKMASK(SLRCONA), 1
#define SLRA2                            BANKMASK(SLRCONA), 2
#define SLRA4                            BANKMASK(SLRCONA), 4
#define SLRA5                            BANKMASK(SLRCONA), 5
#define SLRB4                            BANKMASK(SLRCONB), 4
#define SLRB5                            BANKMASK(SLRCONB), 5
#define SLRB6                            BANKMASK(SLRCONB), 6
#define SLRB7                            BANKMASK(SLRCONB), 7
#define SLRC0                            BANKMASK(SLRCONC), 0
#define SLRC1                            BANKMASK(SLRCONC), 1
#define SLRC2                            BANKMASK(SLRCONC), 2
#define SLRC3                            BANKMASK(SLRCONC), 3
#define SLRC4                            BANKMASK(SLRCONC), 4
#define SLRC5                            BANKMASK(SLRCONC), 5
#define SLRC6                            BANKMASK(SLRCONC), 6
#define SLRC7                            BANKMASK(SLRCONC), 7
#define SMP                              BANKMASK(SSP1STAT), 7
#define SOSCEN                           BANKMASK(T1CON), 3
#define SOSCR                            BANKMASK(OSCSTAT), 7
#define SPEN                             BANKMASK(RC1STA), 7
#define SPLLEN                           BANKMASK(OSCCON), 7
#define SREN                             BANKMASK(RC1STA), 5
#define SSP1ADD0                         BANKMASK(SSP1ADD), 0
#define SSP1ADD1                         BANKMASK(SSP1ADD), 1
#define SSP1ADD2                         BANKMASK(SSP1ADD), 2
#define SSP1ADD3                         BANKMASK(SSP1ADD), 3
#define SSP1ADD4                         BANKMASK(SSP1ADD), 4
#define SSP1ADD5                         BANKMASK(SSP1ADD), 5
#define SSP1ADD6                         BANKMASK(SSP1ADD), 6
#define SSP1ADD7                         BANKMASK(SSP1ADD), 7
#define SSP1BUF0                         BANKMASK(SSP1BUF), 0
#define SSP1BUF1                         BANKMASK(SSP1BUF), 1
#define SSP1BUF2                         BANKMASK(SSP1BUF), 2
#define SSP1BUF3                         BANKMASK(SSP1BUF), 3
#define SSP1BUF4                         BANKMASK(SSP1BUF), 4
#define SSP1BUF5                         BANKMASK(SSP1BUF), 5
#define SSP1BUF6                         BANKMASK(SSP1BUF), 6
#define SSP1BUF7                         BANKMASK(SSP1BUF), 7
#define SSP1IE                           BANKMASK(PIE1), 3
#define SSP1IF                           BANKMASK(PIR1), 3
#define SSP1MSK0                         BANKMASK(SSP1MSK), 0
#define SSP1MSK1                         BANKMASK(SSP1MSK), 1
#define SSP1MSK2                         BANKMASK(SSP1MSK), 2
#define SSP1MSK3                         BANKMASK(SSP1MSK), 3
#define SSP1MSK4                         BANKMASK(SSP1MSK), 4
#define SSP1MSK5                         BANKMASK(SSP1MSK), 5
#define SSP1MSK6                         BANKMASK(SSP1MSK), 6
#define SSP1MSK7                         BANKMASK(SSP1MSK), 7
#define SSPEN                            BANKMASK(SSP1CON1), 5
#define SSPM0                            BANKMASK(SSP1CON1), 0
#define SSPM1                            BANKMASK(SSP1CON1), 1
#define SSPM2                            BANKMASK(SSP1CON1), 2
#define SSPM3                            BANKMASK(SSP1CON1), 3
#define SSPOV                            BANKMASK(SSP1CON1), 6
#define STKOVF                           BANKMASK(PCON), 7
#define STKUNF                           BANKMASK(PCON), 6
#define SWDTEN                           BANKMASK(WDTCON), 0
#define T0CS                             BANKMASK(OPTION_REG), 5
#define T0IE                             BANKMASK(INTCON), 5
#define T0IF                             BANKMASK(INTCON), 2
#define T0SE                             BANKMASK(OPTION_REG), 4
#define T1CKPS0                          BANKMASK(T1CON), 4
#define T1CKPS1                          BANKMASK(T1CON), 5
#define T1CS0                            BANKMASK(T1CON), 6
#define T1CS1                            BANKMASK(T1CON), 7
#define T1GE                             BANKMASK(T1GCON), 7
#define T1GGO_nDONE                      BANKMASK(T1GCON), 3
#define T1GPOL                           BANKMASK(T1GCON), 6
#define T1GSPM                           BANKMASK(T1GCON), 4
#define T1GSS0                           BANKMASK(T1GCON), 0
#define T1GSS1                           BANKMASK(T1GCON), 1
#define T1GTM                            BANKMASK(T1GCON), 5
#define T1GVAL                           BANKMASK(T1GCON), 2
#define T1ON                             BANKMASK(T1CON), 0
#define T1OSCEN                          BANKMASK(T1CON), 3
#define T2CKPOL                          BANKMASK(T2HLT), 6
#define T2CKPS0                          BANKMASK(T2CON), 4
#define T2CKPS1                          BANKMASK(T2CON), 5
#define T2CKPS2                          BANKMASK(T2CON), 6
#define T2CKSYNC                         BANKMASK(T2HLT), 5
#define T2CS0                            BANKMASK(T2CLKCON), 0
#define T2CS1                            BANKMASK(T2CLKCON), 1
#define T2CS2                            BANKMASK(T2CLKCON), 2
#define T2CS3                            BANKMASK(T2CLKCON), 3
#define T2MODE0                          BANKMASK(T2HLT), 0
#define T2MODE1                          BANKMASK(T2HLT), 1
#define T2MODE2                          BANKMASK(T2HLT), 2
#define T2MODE3                          BANKMASK(T2HLT), 3
#define T2MODE4                          BANKMASK(T2HLT), 4
#define T2ON                             BANKMASK(T2CON), 7
#define T2OUTPS0                         BANKMASK(T2CON), 0
#define T2OUTPS1                         BANKMASK(T2CON), 1
#define T2OUTPS2                         BANKMASK(T2CON), 2
#define T2OUTPS3                         BANKMASK(T2CON), 3
#define T2PSYNC                          BANKMASK(T2HLT), 7
#define T2RSEL0                          BANKMASK(T2RST), 0
#define T2RSEL1                          BANKMASK(T2RST), 1
#define T2RSEL2                          BANKMASK(T2RST), 2
#define T2RSEL3                          BANKMASK(T2RST), 3
#define T3CKPS0                          BANKMASK(T3CON), 4
#define T3CKPS1                          BANKMASK(T3CON), 5
#define T3CS0                            BANKMASK(T3CON), 6
#define T3CS1                            BANKMASK(T3CON), 7
#define T3GE                             BANKMASK(T3GCON), 7
#define T3GGO_nDONE                      BANKMASK(T3GCON), 3
#define T3GPOL                           BANKMASK(T3GCON), 6
#define T3GSPM                           BANKMASK(T3GCON), 4
#define T3GSS0                           BANKMASK(T3GCON), 0
#define T3GSS1                           BANKMASK(T3GCON), 1
#define T3GTM                            BANKMASK(T3GCON), 5
#define T3GVAL                           BANKMASK(T3GCON), 2
#define T3ON                             BANKMASK(T3CON), 0
#define T4CKPOL                          BANKMASK(T4HLT), 6
#define T4CKPS0                          BANKMASK(T4CON), 4
#define T4CKPS1                          BANKMASK(T4CON), 5
#define T4CKPS2                          BANKMASK(T4CON), 6
#define T4CKSYNC                         BANKMASK(T4HLT), 5
#define T4CS0                            BANKMASK(T4CLKCON), 0
#define T4CS1                            BANKMASK(T4CLKCON), 1
#define T4CS2                            BANKMASK(T4CLKCON), 2
#define T4CS3                            BANKMASK(T4CLKCON), 3
#define T4MODE0                          BANKMASK(T4HLT), 0
#define T4MODE1                          BANKMASK(T4HLT), 1
#define T4MODE2                          BANKMASK(T4HLT), 2
#define T4MODE3                          BANKMASK(T4HLT), 3
#define T4MODE4                          BANKMASK(T4HLT), 4
#define T4ON                             BANKMASK(T4CON), 7
#define T4OUTPS0                         BANKMASK(T4CON), 0
#define T4OUTPS1                         BANKMASK(T4CON), 1
#define T4OUTPS2                         BANKMASK(T4CON), 2
#define T4OUTPS3                         BANKMASK(T4CON), 3
#define T4PSYNC                          BANKMASK(T4HLT), 7
#define T4RSEL0                          BANKMASK(T4RST), 0
#define T4RSEL1                          BANKMASK(T4RST), 1
#define T4RSEL2                          BANKMASK(T4RST), 2
#define T4RSEL3                          BANKMASK(T4RST), 3
#define T5CKPS0                          BANKMASK(T5CON), 4
#define T5CKPS1                          BANKMASK(T5CON), 5
#define T5CS0                            BANKMASK(T5CON), 6
#define T5CS1                            BANKMASK(T5CON), 7
#define T5GE                             BANKMASK(T5GCON), 7
#define T5GGO_nDONE                      BANKMASK(T5GCON), 3
#define T5GPOL                           BANKMASK(T5GCON), 6
#define T5GSPM                           BANKMASK(T5GCON), 4
#define T5GSS0                           BANKMASK(T5GCON), 0
#define T5GSS1                           BANKMASK(T5GCON), 1
#define T5GTM                            BANKMASK(T5GCON), 5
#define T5GVAL                           BANKMASK(T5GCON), 2
#define T5ON                             BANKMASK(T5CON), 0
#define T6CKPOL                          BANKMASK(T6HLT), 6
#define T6CKPS0                          BANKMASK(T6CON), 4
#define T6CKPS1                          BANKMASK(T6CON), 5
#define T6CKPS2                          BANKMASK(T6CON), 6
#define T6CKSYNC                         BANKMASK(T6HLT), 5
#define T6CS0                            BANKMASK(T6CLKCON), 0
#define T6CS1                            BANKMASK(T6CLKCON), 1
#define T6CS2                            BANKMASK(T6CLKCON), 2
#define T6CS3                            BANKMASK(T6CLKCON), 3
#define T6MODE0                          BANKMASK(T6HLT), 0
#define T6MODE1                          BANKMASK(T6HLT), 1
#define T6MODE2                          BANKMASK(T6HLT), 2
#define T6MODE3                          BANKMASK(T6HLT), 3
#define T6MODE4                          BANKMASK(T6HLT), 4
#define T6ON                             BANKMASK(T6CON), 7
#define T6OUTPS0                         BANKMASK(T6CON), 0
#define T6OUTPS1                         BANKMASK(T6CON), 1
#define T6OUTPS2                         BANKMASK(T6CON), 2
#define T6OUTPS3                         BANKMASK(T6CON), 3
#define T6PSYNC                          BANKMASK(T6HLT), 7
#define T6RSEL0                          BANKMASK(T6RST), 0
#define T6RSEL1                          BANKMASK(T6RST), 1
#define T6RSEL2                          BANKMASK(T6RST), 2
#define T6RSEL3                          BANKMASK(T6RST), 3
#define TMR0CS                           BANKMASK(OPTION_REG), 5
#define TMR0IE                           BANKMASK(INTCON), 5
#define TMR0IF                           BANKMASK(INTCON), 2
#define TMR0SE                           BANKMASK(OPTION_REG), 4
#define TMR1CS0                          BANKMASK(T1CON), 6
#define TMR1CS1                          BANKMASK(T1CON), 7
#define TMR1GE                           BANKMASK(T1GCON), 7
#define TMR1GIE                          BANKMASK(PIE1), 7
#define TMR1GIF                          BANKMASK(PIR1), 7
#define TMR1IE                           BANKMASK(PIE1), 0
#define TMR1IF                           BANKMASK(PIR1), 0
#define TMR1ON                           BANKMASK(T1CON), 0
#define TMR2IE                           BANKMASK(PIE1), 1
#define TMR2IF                           BANKMASK(PIR1), 1
#define TMR2ON                           BANKMASK(T2CON), 7
#define TMR3CS0                          BANKMASK(T3CON), 6
#define TMR3CS1                          BANKMASK(T3CON), 7
#define TMR3GE                           BANKMASK(T3GCON), 7
#define TMR3GIE                          BANKMASK(PIE4), 3
#define TMR3GIF                          BANKMASK(PIR4), 3
#define TMR3IE                           BANKMASK(PIE4), 2
#define TMR3IF                           BANKMASK(PIR4), 2
#define TMR3ON                           BANKMASK(T3CON), 0
#define TMR4IE                           BANKMASK(PIE4), 0
#define TMR4IF                           BANKMASK(PIR4), 0
#define TMR4ON                           BANKMASK(T4CON), 7
#define TMR5CS0                          BANKMASK(T5CON), 6
#define TMR5CS1                          BANKMASK(T5CON), 7
#define TMR5GE                           BANKMASK(T5GCON), 7
#define TMR5GIE                          BANKMASK(PIE4), 5
#define TMR5GIF                          BANKMASK(PIR4), 5
#define TMR5IE                           BANKMASK(PIE4), 4
#define TMR5IF                           BANKMASK(PIR4), 4
#define TMR5ON                           BANKMASK(T5CON), 0
#define TMR6IE                           BANKMASK(PIE4), 1
#define TMR6IF                           BANKMASK(PIR4), 1
#define TMR6ON                           BANKMASK(T6CON), 7
#define TRIGSEL0                         BANKMASK(ADCON2), 3
#define TRIGSEL1                         BANKMASK(ADCON2), 4
#define TRIGSEL2                         BANKMASK(ADCON2), 5
#define TRIGSEL3                         BANKMASK(ADCON2), 6
#define TRIGSEL4                         BANKMASK(ADCON2), 7
#define TRISA0                           BANKMASK(TRISA), 0
#define TRISA1                           BANKMASK(TRISA), 1
#define TRISA2                           BANKMASK(TRISA), 2
#define TRISA4                           BANKMASK(TRISA), 4
#define TRISA5                           BANKMASK(TRISA), 5
